---
type: FabricationPartBrowserChangedEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 8
tags: [revit-api, class]
---

# FabricationPartBrowserChangedEventArgs

`Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAllSolutionsPartsTypeCounts | 2017 | `public IDictionary < ElementId , int > GetAllSolutionsPartsTypeCounts ()` |
| Method | GetCurrentSolutionPartTypeIds | 2017 | `public ISet < ElementId > GetCurrentSolutionPartTypeIds ()` |
| Method | GetFabricationPartTypeIds | 2017 | `public ISet < ElementId > GetFabricationPartTypeIds ()` |
| Method | GetFilteredSolutionsPartsTypeCounts | 2017 | `public IDictionary < ElementId , int > GetFilteredSolutionsPartsTypeCounts ()` |
| Method | GetRequiredFabricationPartTypeIds | 2017 | `public ISet < ElementId > GetRequiredFabricationPartTypeIds ()` |
| Property | NumberOfSolutions | 2017 | `public int NumberOfSolutions { get ; }` |
| Property | Operation | 2017 | `public FabricationPartBrowserOperation Operation { get ; }` |
| Property | ServiceId | 2017 | `public int ServiceId { get ; }` |